{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v3.18.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of8.bin", "group1-shard2of8.bin", "group1-shard3of8.bin", "group1-shard4of8.bin", "group1-shard5of8.bin", "group1-shard6of8.bin", "group1-shard7of8.bin", "group1-shard8of8.bin"], "weights": [{"name": "conv1/conv/kernel", "shape": [7, 7, 3, 64], "dtype": "float32"}, {"name": "conv1/bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "conv1/bn/beta", "shape": [64], "dtype": "float32"}, {"name": "conv1/bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "conv1/bn/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2/block1/0/bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "conv2/block1/0/bn/beta", "shape": [64], "dtype": "float32"}, {"name": "conv2/block1/0/bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "conv2/block1/0/bn/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2/block1/1/conv/kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "conv2/block1/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv2/block1/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv2/block1/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv2/block1/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv2/block1/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv2/block2/0/bn/gamma", "shape": [96], "dtype": "float32"}, {"name": "conv2/block2/0/bn/beta", "shape": [96], "dtype": "float32"}, {"name": "conv2/block2/0/bn/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "conv2/block2/0/bn/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "conv2/block2/1/conv/kernel", "shape": [1, 1, 96, 128], "dtype": "float32"}, {"name": "conv2/block2/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv2/block2/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv2/block2/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv2/block2/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv2/block2/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv2/block3/0/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv2/block3/0/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv2/block3/0/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv2/block3/0/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv2/block3/1/conv/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "conv2/block3/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv2/block3/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv2/block3/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv2/block3/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv2/block3/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv2/block4/0/bn/gamma", "shape": [160], "dtype": "float32"}, {"name": "conv2/block4/0/bn/beta", "shape": [160], "dtype": "float32"}, {"name": "conv2/block4/0/bn/moving_mean", "shape": [160], "dtype": "float32"}, {"name": "conv2/block4/0/bn/moving_variance", "shape": [160], "dtype": "float32"}, {"name": "conv2/block4/1/conv/kernel", "shape": [1, 1, 160, 128], "dtype": "float32"}, {"name": "conv2/block4/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv2/block4/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv2/block4/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv2/block4/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv2/block4/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv2/block5/0/bn/gamma", "shape": [192], "dtype": "float32"}, {"name": "conv2/block5/0/bn/beta", "shape": [192], "dtype": "float32"}, {"name": "conv2/block5/0/bn/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "conv2/block5/0/bn/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "conv2/block5/1/conv/kernel", "shape": [1, 1, 192, 128], "dtype": "float32"}, {"name": "conv2/block5/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv2/block5/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv2/block5/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv2/block5/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv2/block5/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv2/block6/0/bn/gamma", "shape": [224], "dtype": "float32"}, {"name": "conv2/block6/0/bn/beta", "shape": [224], "dtype": "float32"}, {"name": "conv2/block6/0/bn/moving_mean", "shape": [224], "dtype": "float32"}, {"name": "conv2/block6/0/bn/moving_variance", "shape": [224], "dtype": "float32"}, {"name": "conv2/block6/1/conv/kernel", "shape": [1, 1, 224, 128], "dtype": "float32"}, {"name": "conv2/block6/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv2/block6/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv2/block6/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv2/block6/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv2/block6/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "pool2/bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "pool2/bn/beta", "shape": [256], "dtype": "float32"}, {"name": "pool2/bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "pool2/bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "pool2/conv/kernel", "shape": [1, 1, 256, 128], "dtype": "float32"}, {"name": "conv3/block1/0/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3/block1/0/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3/block1/0/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3/block1/0/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3/block1/1/conv/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "conv3/block1/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3/block1/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3/block1/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3/block1/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3/block1/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv3/block2/0/bn/gamma", "shape": [160], "dtype": "float32"}, {"name": "conv3/block2/0/bn/beta", "shape": [160], "dtype": "float32"}, {"name": "conv3/block2/0/bn/moving_mean", "shape": [160], "dtype": "float32"}, {"name": "conv3/block2/0/bn/moving_variance", "shape": [160], "dtype": "float32"}, {"name": "conv3/block2/1/conv/kernel", "shape": [1, 1, 160, 128], "dtype": "float32"}, {"name": "conv3/block2/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3/block2/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3/block2/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3/block2/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3/block2/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv3/block3/0/bn/gamma", "shape": [192], "dtype": "float32"}, {"name": "conv3/block3/0/bn/beta", "shape": [192], "dtype": "float32"}, {"name": "conv3/block3/0/bn/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "conv3/block3/0/bn/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "conv3/block3/1/conv/kernel", "shape": [1, 1, 192, 128], "dtype": "float32"}, {"name": "conv3/block3/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3/block3/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3/block3/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3/block3/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3/block3/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv3/block4/0/bn/gamma", "shape": [224], "dtype": "float32"}, {"name": "conv3/block4/0/bn/beta", "shape": [224], "dtype": "float32"}, {"name": "conv3/block4/0/bn/moving_mean", "shape": [224], "dtype": "float32"}, {"name": "conv3/block4/0/bn/moving_variance", "shape": [224], "dtype": "float32"}, {"name": "conv3/block4/1/conv/kernel", "shape": [1, 1, 224, 128], "dtype": "float32"}, {"name": "conv3/block4/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3/block4/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3/block4/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3/block4/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3/block4/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv3/block5/0/bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv3/block5/0/bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv3/block5/0/bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv3/block5/0/bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv3/block5/1/conv/kernel", "shape": [1, 1, 256, 128], "dtype": "float32"}, {"name": "conv3/block5/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3/block5/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3/block5/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3/block5/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3/block5/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv3/block6/0/bn/gamma", "shape": [288], "dtype": "float32"}, {"name": "conv3/block6/0/bn/beta", "shape": [288], "dtype": "float32"}, {"name": "conv3/block6/0/bn/moving_mean", "shape": [288], "dtype": "float32"}, {"name": "conv3/block6/0/bn/moving_variance", "shape": [288], "dtype": "float32"}, {"name": "conv3/block6/1/conv/kernel", "shape": [1, 1, 288, 128], "dtype": "float32"}, {"name": "conv3/block6/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3/block6/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3/block6/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3/block6/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3/block6/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv3/block7/0/bn/gamma", "shape": [320], "dtype": "float32"}, {"name": "conv3/block7/0/bn/beta", "shape": [320], "dtype": "float32"}, {"name": "conv3/block7/0/bn/moving_mean", "shape": [320], "dtype": "float32"}, {"name": "conv3/block7/0/bn/moving_variance", "shape": [320], "dtype": "float32"}, {"name": "conv3/block7/1/conv/kernel", "shape": [1, 1, 320, 128], "dtype": "float32"}, {"name": "conv3/block7/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3/block7/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3/block7/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3/block7/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3/block7/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv3/block8/0/bn/gamma", "shape": [352], "dtype": "float32"}, {"name": "conv3/block8/0/bn/beta", "shape": [352], "dtype": "float32"}, {"name": "conv3/block8/0/bn/moving_mean", "shape": [352], "dtype": "float32"}, {"name": "conv3/block8/0/bn/moving_variance", "shape": [352], "dtype": "float32"}, {"name": "conv3/block8/1/conv/kernel", "shape": [1, 1, 352, 128], "dtype": "float32"}, {"name": "conv3/block8/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3/block8/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3/block8/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3/block8/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3/block8/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv3/block9/0/bn/gamma", "shape": [384], "dtype": "float32"}, {"name": "conv3/block9/0/bn/beta", "shape": [384], "dtype": "float32"}, {"name": "conv3/block9/0/bn/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "conv3/block9/0/bn/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "conv3/block9/1/conv/kernel", "shape": [1, 1, 384, 128], "dtype": "float32"}, {"name": "conv3/block9/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3/block9/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3/block9/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3/block9/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3/block9/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv3/block10/0/bn/gamma", "shape": [416], "dtype": "float32"}, {"name": "conv3/block10/0/bn/beta", "shape": [416], "dtype": "float32"}, {"name": "conv3/block10/0/bn/moving_mean", "shape": [416], "dtype": "float32"}, {"name": "conv3/block10/0/bn/moving_variance", "shape": [416], "dtype": "float32"}, {"name": "conv3/block10/1/conv/kernel", "shape": [1, 1, 416, 128], "dtype": "float32"}, {"name": "conv3/block10/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3/block10/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3/block10/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3/block10/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3/block10/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv3/block11/0/bn/gamma", "shape": [448], "dtype": "float32"}, {"name": "conv3/block11/0/bn/beta", "shape": [448], "dtype": "float32"}, {"name": "conv3/block11/0/bn/moving_mean", "shape": [448], "dtype": "float32"}, {"name": "conv3/block11/0/bn/moving_variance", "shape": [448], "dtype": "float32"}, {"name": "conv3/block11/1/conv/kernel", "shape": [1, 1, 448, 128], "dtype": "float32"}, {"name": "conv3/block11/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3/block11/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3/block11/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3/block11/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3/block11/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv3/block12/0/bn/gamma", "shape": [480], "dtype": "float32"}, {"name": "conv3/block12/0/bn/beta", "shape": [480], "dtype": "float32"}, {"name": "conv3/block12/0/bn/moving_mean", "shape": [480], "dtype": "float32"}, {"name": "conv3/block12/0/bn/moving_variance", "shape": [480], "dtype": "float32"}, {"name": "conv3/block12/1/conv/kernel", "shape": [1, 1, 480, 128], "dtype": "float32"}, {"name": "conv3/block12/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3/block12/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3/block12/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3/block12/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3/block12/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "pool3/bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "pool3/bn/beta", "shape": [512], "dtype": "float32"}, {"name": "pool3/bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "pool3/bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "pool3/conv/kernel", "shape": [1, 1, 512, 256], "dtype": "float32"}, {"name": "conv4/block1/0/bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4/block1/0/bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4/block1/0/bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4/block1/0/bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4/block1/1/conv/kernel", "shape": [1, 1, 256, 128], "dtype": "float32"}, {"name": "conv4/block1/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv4/block1/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv4/block1/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv4/block1/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv4/block1/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv4/block2/0/bn/gamma", "shape": [288], "dtype": "float32"}, {"name": "conv4/block2/0/bn/beta", "shape": [288], "dtype": "float32"}, {"name": "conv4/block2/0/bn/moving_mean", "shape": [288], "dtype": "float32"}, {"name": "conv4/block2/0/bn/moving_variance", "shape": [288], "dtype": "float32"}, {"name": "conv4/block2/1/conv/kernel", "shape": [1, 1, 288, 128], "dtype": "float32"}, {"name": "conv4/block2/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv4/block2/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv4/block2/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv4/block2/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv4/block2/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv4/block3/0/bn/gamma", "shape": [320], "dtype": "float32"}, {"name": "conv4/block3/0/bn/beta", "shape": [320], "dtype": "float32"}, {"name": "conv4/block3/0/bn/moving_mean", "shape": [320], "dtype": "float32"}, {"name": "conv4/block3/0/bn/moving_variance", "shape": [320], "dtype": "float32"}, {"name": "conv4/block3/1/conv/kernel", "shape": [1, 1, 320, 128], "dtype": "float32"}, {"name": "conv4/block3/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv4/block3/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv4/block3/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv4/block3/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv4/block3/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv4/block4/0/bn/gamma", "shape": [352], "dtype": "float32"}, {"name": "conv4/block4/0/bn/beta", "shape": [352], "dtype": "float32"}, {"name": "conv4/block4/0/bn/moving_mean", "shape": [352], "dtype": "float32"}, {"name": "conv4/block4/0/bn/moving_variance", "shape": [352], "dtype": "float32"}, {"name": "conv4/block4/1/conv/kernel", "shape": [1, 1, 352, 128], "dtype": "float32"}, {"name": "conv4/block4/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv4/block4/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv4/block4/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv4/block4/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv4/block4/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv4/block5/0/bn/gamma", "shape": [384], "dtype": "float32"}, {"name": "conv4/block5/0/bn/beta", "shape": [384], "dtype": "float32"}, {"name": "conv4/block5/0/bn/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "conv4/block5/0/bn/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "conv4/block5/1/conv/kernel", "shape": [1, 1, 384, 128], "dtype": "float32"}, {"name": "conv4/block5/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv4/block5/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv4/block5/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv4/block5/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv4/block5/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv4/block6/0/bn/gamma", "shape": [416], "dtype": "float32"}, {"name": "conv4/block6/0/bn/beta", "shape": [416], "dtype": "float32"}, {"name": "conv4/block6/0/bn/moving_mean", "shape": [416], "dtype": "float32"}, {"name": "conv4/block6/0/bn/moving_variance", "shape": [416], "dtype": "float32"}, {"name": "conv4/block6/1/conv/kernel", "shape": [1, 1, 416, 128], "dtype": "float32"}, {"name": "conv4/block6/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv4/block6/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv4/block6/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv4/block6/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv4/block6/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv4/block7/0/bn/gamma", "shape": [448], "dtype": "float32"}, {"name": "conv4/block7/0/bn/beta", "shape": [448], "dtype": "float32"}, {"name": "conv4/block7/0/bn/moving_mean", "shape": [448], "dtype": "float32"}, {"name": "conv4/block7/0/bn/moving_variance", "shape": [448], "dtype": "float32"}, {"name": "conv4/block7/1/conv/kernel", "shape": [1, 1, 448, 128], "dtype": "float32"}, {"name": "conv4/block7/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv4/block7/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv4/block7/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv4/block7/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv4/block7/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv4/block8/0/bn/gamma", "shape": [480], "dtype": "float32"}, {"name": "conv4/block8/0/bn/beta", "shape": [480], "dtype": "float32"}, {"name": "conv4/block8/0/bn/moving_mean", "shape": [480], "dtype": "float32"}, {"name": "conv4/block8/0/bn/moving_variance", "shape": [480], "dtype": "float32"}, {"name": "conv4/block8/1/conv/kernel", "shape": [1, 1, 480, 128], "dtype": "float32"}, {"name": "conv4/block8/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv4/block8/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv4/block8/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv4/block8/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv4/block8/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv4/block9/0/bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv4/block9/0/bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv4/block9/0/bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv4/block9/0/bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv4/block9/1/conv/kernel", "shape": [1, 1, 512, 128], "dtype": "float32"}, {"name": "conv4/block9/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv4/block9/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv4/block9/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv4/block9/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv4/block9/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv4/block10/0/bn/gamma", "shape": [544], "dtype": "float32"}, {"name": "conv4/block10/0/bn/beta", "shape": [544], "dtype": "float32"}, {"name": "conv4/block10/0/bn/moving_mean", "shape": [544], "dtype": "float32"}, {"name": "conv4/block10/0/bn/moving_variance", "shape": [544], "dtype": "float32"}, {"name": "conv4/block10/1/conv/kernel", "shape": [1, 1, 544, 128], "dtype": "float32"}, {"name": "conv4/block10/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv4/block10/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv4/block10/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv4/block10/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv4/block10/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv4/block11/0/bn/gamma", "shape": [576], "dtype": "float32"}, {"name": "conv4/block11/0/bn/beta", "shape": [576], "dtype": "float32"}, {"name": "conv4/block11/0/bn/moving_mean", "shape": [576], "dtype": "float32"}, {"name": "conv4/block11/0/bn/moving_variance", "shape": [576], "dtype": "float32"}, {"name": "conv4/block11/1/conv/kernel", "shape": [1, 1, 576, 128], "dtype": "float32"}, {"name": "conv4/block11/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv4/block11/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv4/block11/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv4/block11/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv4/block11/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv4/block12/0/bn/gamma", "shape": [608], "dtype": "float32"}, {"name": "conv4/block12/0/bn/beta", "shape": [608], "dtype": "float32"}, {"name": "conv4/block12/0/bn/moving_mean", "shape": [608], "dtype": "float32"}, {"name": "conv4/block12/0/bn/moving_variance", "shape": [608], "dtype": "float32"}, {"name": "conv4/block12/1/conv/kernel", "shape": [1, 1, 608, 128], "dtype": "float32"}, {"name": "conv4/block12/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv4/block12/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv4/block12/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv4/block12/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv4/block12/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv4/block13/0/bn/gamma", "shape": [640], "dtype": "float32"}, {"name": "conv4/block13/0/bn/beta", "shape": [640], "dtype": "float32"}, {"name": "conv4/block13/0/bn/moving_mean", "shape": [640], "dtype": "float32"}, {"name": "conv4/block13/0/bn/moving_variance", "shape": [640], "dtype": "float32"}, {"name": "conv4/block13/1/conv/kernel", "shape": [1, 1, 640, 128], "dtype": "float32"}, {"name": "conv4/block13/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv4/block13/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv4/block13/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv4/block13/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv4/block13/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv4/block14/0/bn/gamma", "shape": [672], "dtype": "float32"}, {"name": "conv4/block14/0/bn/beta", "shape": [672], "dtype": "float32"}, {"name": "conv4/block14/0/bn/moving_mean", "shape": [672], "dtype": "float32"}, {"name": "conv4/block14/0/bn/moving_variance", "shape": [672], "dtype": "float32"}, {"name": "conv4/block14/1/conv/kernel", "shape": [1, 1, 672, 128], "dtype": "float32"}, {"name": "conv4/block14/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv4/block14/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv4/block14/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv4/block14/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv4/block14/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv4/block15/0/bn/gamma", "shape": [704], "dtype": "float32"}, {"name": "conv4/block15/0/bn/beta", "shape": [704], "dtype": "float32"}, {"name": "conv4/block15/0/bn/moving_mean", "shape": [704], "dtype": "float32"}, {"name": "conv4/block15/0/bn/moving_variance", "shape": [704], "dtype": "float32"}, {"name": "conv4/block15/1/conv/kernel", "shape": [1, 1, 704, 128], "dtype": "float32"}, {"name": "conv4/block15/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv4/block15/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv4/block15/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv4/block15/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv4/block15/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv4/block16/0/bn/gamma", "shape": [736], "dtype": "float32"}, {"name": "conv4/block16/0/bn/beta", "shape": [736], "dtype": "float32"}, {"name": "conv4/block16/0/bn/moving_mean", "shape": [736], "dtype": "float32"}, {"name": "conv4/block16/0/bn/moving_variance", "shape": [736], "dtype": "float32"}, {"name": "conv4/block16/1/conv/kernel", "shape": [1, 1, 736, 128], "dtype": "float32"}, {"name": "conv4/block16/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv4/block16/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv4/block16/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv4/block16/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv4/block16/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv4/block17/0/bn/gamma", "shape": [768], "dtype": "float32"}, {"name": "conv4/block17/0/bn/beta", "shape": [768], "dtype": "float32"}, {"name": "conv4/block17/0/bn/moving_mean", "shape": [768], "dtype": "float32"}, {"name": "conv4/block17/0/bn/moving_variance", "shape": [768], "dtype": "float32"}, {"name": "conv4/block17/1/conv/kernel", "shape": [1, 1, 768, 128], "dtype": "float32"}, {"name": "conv4/block17/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv4/block17/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv4/block17/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv4/block17/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv4/block17/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv4/block18/0/bn/gamma", "shape": [800], "dtype": "float32"}, {"name": "conv4/block18/0/bn/beta", "shape": [800], "dtype": "float32"}, {"name": "conv4/block18/0/bn/moving_mean", "shape": [800], "dtype": "float32"}, {"name": "conv4/block18/0/bn/moving_variance", "shape": [800], "dtype": "float32"}, {"name": "conv4/block18/1/conv/kernel", "shape": [1, 1, 800, 128], "dtype": "float32"}, {"name": "conv4/block18/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv4/block18/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv4/block18/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv4/block18/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv4/block18/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv4/block19/0/bn/gamma", "shape": [832], "dtype": "float32"}, {"name": "conv4/block19/0/bn/beta", "shape": [832], "dtype": "float32"}, {"name": "conv4/block19/0/bn/moving_mean", "shape": [832], "dtype": "float32"}, {"name": "conv4/block19/0/bn/moving_variance", "shape": [832], "dtype": "float32"}, {"name": "conv4/block19/1/conv/kernel", "shape": [1, 1, 832, 128], "dtype": "float32"}, {"name": "conv4/block19/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv4/block19/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv4/block19/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv4/block19/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv4/block19/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv4/block20/0/bn/gamma", "shape": [864], "dtype": "float32"}, {"name": "conv4/block20/0/bn/beta", "shape": [864], "dtype": "float32"}, {"name": "conv4/block20/0/bn/moving_mean", "shape": [864], "dtype": "float32"}, {"name": "conv4/block20/0/bn/moving_variance", "shape": [864], "dtype": "float32"}, {"name": "conv4/block20/1/conv/kernel", "shape": [1, 1, 864, 128], "dtype": "float32"}, {"name": "conv4/block20/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv4/block20/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv4/block20/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv4/block20/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv4/block20/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv4/block21/0/bn/gamma", "shape": [896], "dtype": "float32"}, {"name": "conv4/block21/0/bn/beta", "shape": [896], "dtype": "float32"}, {"name": "conv4/block21/0/bn/moving_mean", "shape": [896], "dtype": "float32"}, {"name": "conv4/block21/0/bn/moving_variance", "shape": [896], "dtype": "float32"}, {"name": "conv4/block21/1/conv/kernel", "shape": [1, 1, 896, 128], "dtype": "float32"}, {"name": "conv4/block21/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv4/block21/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv4/block21/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv4/block21/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv4/block21/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv4/block22/0/bn/gamma", "shape": [928], "dtype": "float32"}, {"name": "conv4/block22/0/bn/beta", "shape": [928], "dtype": "float32"}, {"name": "conv4/block22/0/bn/moving_mean", "shape": [928], "dtype": "float32"}, {"name": "conv4/block22/0/bn/moving_variance", "shape": [928], "dtype": "float32"}, {"name": "conv4/block22/1/conv/kernel", "shape": [1, 1, 928, 128], "dtype": "float32"}, {"name": "conv4/block22/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv4/block22/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv4/block22/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv4/block22/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv4/block22/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv4/block23/0/bn/gamma", "shape": [960], "dtype": "float32"}, {"name": "conv4/block23/0/bn/beta", "shape": [960], "dtype": "float32"}, {"name": "conv4/block23/0/bn/moving_mean", "shape": [960], "dtype": "float32"}, {"name": "conv4/block23/0/bn/moving_variance", "shape": [960], "dtype": "float32"}, {"name": "conv4/block23/1/conv/kernel", "shape": [1, 1, 960, 128], "dtype": "float32"}, {"name": "conv4/block23/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv4/block23/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv4/block23/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv4/block23/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv4/block23/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv4/block24/0/bn/gamma", "shape": [992], "dtype": "float32"}, {"name": "conv4/block24/0/bn/beta", "shape": [992], "dtype": "float32"}, {"name": "conv4/block24/0/bn/moving_mean", "shape": [992], "dtype": "float32"}, {"name": "conv4/block24/0/bn/moving_variance", "shape": [992], "dtype": "float32"}, {"name": "conv4/block24/1/conv/kernel", "shape": [1, 1, 992, 128], "dtype": "float32"}, {"name": "conv4/block24/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv4/block24/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv4/block24/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv4/block24/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv4/block24/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "pool4/bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "pool4/bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "pool4/bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "pool4/bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "pool4/conv/kernel", "shape": [1, 1, 1024, 512], "dtype": "float32"}, {"name": "conv5/block1/0/bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv5/block1/0/bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv5/block1/0/bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv5/block1/0/bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv5/block1/1/conv/kernel", "shape": [1, 1, 512, 128], "dtype": "float32"}, {"name": "conv5/block1/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv5/block1/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv5/block1/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv5/block1/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv5/block1/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv5/block2/0/bn/gamma", "shape": [544], "dtype": "float32"}, {"name": "conv5/block2/0/bn/beta", "shape": [544], "dtype": "float32"}, {"name": "conv5/block2/0/bn/moving_mean", "shape": [544], "dtype": "float32"}, {"name": "conv5/block2/0/bn/moving_variance", "shape": [544], "dtype": "float32"}, {"name": "conv5/block2/1/conv/kernel", "shape": [1, 1, 544, 128], "dtype": "float32"}, {"name": "conv5/block2/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv5/block2/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv5/block2/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv5/block2/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv5/block2/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv5/block3/0/bn/gamma", "shape": [576], "dtype": "float32"}, {"name": "conv5/block3/0/bn/beta", "shape": [576], "dtype": "float32"}, {"name": "conv5/block3/0/bn/moving_mean", "shape": [576], "dtype": "float32"}, {"name": "conv5/block3/0/bn/moving_variance", "shape": [576], "dtype": "float32"}, {"name": "conv5/block3/1/conv/kernel", "shape": [1, 1, 576, 128], "dtype": "float32"}, {"name": "conv5/block3/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv5/block3/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv5/block3/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv5/block3/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv5/block3/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv5/block4/0/bn/gamma", "shape": [608], "dtype": "float32"}, {"name": "conv5/block4/0/bn/beta", "shape": [608], "dtype": "float32"}, {"name": "conv5/block4/0/bn/moving_mean", "shape": [608], "dtype": "float32"}, {"name": "conv5/block4/0/bn/moving_variance", "shape": [608], "dtype": "float32"}, {"name": "conv5/block4/1/conv/kernel", "shape": [1, 1, 608, 128], "dtype": "float32"}, {"name": "conv5/block4/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv5/block4/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv5/block4/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv5/block4/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv5/block4/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv5/block5/0/bn/gamma", "shape": [640], "dtype": "float32"}, {"name": "conv5/block5/0/bn/beta", "shape": [640], "dtype": "float32"}, {"name": "conv5/block5/0/bn/moving_mean", "shape": [640], "dtype": "float32"}, {"name": "conv5/block5/0/bn/moving_variance", "shape": [640], "dtype": "float32"}, {"name": "conv5/block5/1/conv/kernel", "shape": [1, 1, 640, 128], "dtype": "float32"}, {"name": "conv5/block5/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv5/block5/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv5/block5/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv5/block5/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv5/block5/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv5/block6/0/bn/gamma", "shape": [672], "dtype": "float32"}, {"name": "conv5/block6/0/bn/beta", "shape": [672], "dtype": "float32"}, {"name": "conv5/block6/0/bn/moving_mean", "shape": [672], "dtype": "float32"}, {"name": "conv5/block6/0/bn/moving_variance", "shape": [672], "dtype": "float32"}, {"name": "conv5/block6/1/conv/kernel", "shape": [1, 1, 672, 128], "dtype": "float32"}, {"name": "conv5/block6/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv5/block6/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv5/block6/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv5/block6/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv5/block6/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv5/block7/0/bn/gamma", "shape": [704], "dtype": "float32"}, {"name": "conv5/block7/0/bn/beta", "shape": [704], "dtype": "float32"}, {"name": "conv5/block7/0/bn/moving_mean", "shape": [704], "dtype": "float32"}, {"name": "conv5/block7/0/bn/moving_variance", "shape": [704], "dtype": "float32"}, {"name": "conv5/block7/1/conv/kernel", "shape": [1, 1, 704, 128], "dtype": "float32"}, {"name": "conv5/block7/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv5/block7/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv5/block7/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv5/block7/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv5/block7/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv5/block8/0/bn/gamma", "shape": [736], "dtype": "float32"}, {"name": "conv5/block8/0/bn/beta", "shape": [736], "dtype": "float32"}, {"name": "conv5/block8/0/bn/moving_mean", "shape": [736], "dtype": "float32"}, {"name": "conv5/block8/0/bn/moving_variance", "shape": [736], "dtype": "float32"}, {"name": "conv5/block8/1/conv/kernel", "shape": [1, 1, 736, 128], "dtype": "float32"}, {"name": "conv5/block8/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv5/block8/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv5/block8/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv5/block8/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv5/block8/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv5/block9/0/bn/gamma", "shape": [768], "dtype": "float32"}, {"name": "conv5/block9/0/bn/beta", "shape": [768], "dtype": "float32"}, {"name": "conv5/block9/0/bn/moving_mean", "shape": [768], "dtype": "float32"}, {"name": "conv5/block9/0/bn/moving_variance", "shape": [768], "dtype": "float32"}, {"name": "conv5/block9/1/conv/kernel", "shape": [1, 1, 768, 128], "dtype": "float32"}, {"name": "conv5/block9/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv5/block9/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv5/block9/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv5/block9/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv5/block9/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv5/block10/0/bn/gamma", "shape": [800], "dtype": "float32"}, {"name": "conv5/block10/0/bn/beta", "shape": [800], "dtype": "float32"}, {"name": "conv5/block10/0/bn/moving_mean", "shape": [800], "dtype": "float32"}, {"name": "conv5/block10/0/bn/moving_variance", "shape": [800], "dtype": "float32"}, {"name": "conv5/block10/1/conv/kernel", "shape": [1, 1, 800, 128], "dtype": "float32"}, {"name": "conv5/block10/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv5/block10/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv5/block10/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv5/block10/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv5/block10/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv5/block11/0/bn/gamma", "shape": [832], "dtype": "float32"}, {"name": "conv5/block11/0/bn/beta", "shape": [832], "dtype": "float32"}, {"name": "conv5/block11/0/bn/moving_mean", "shape": [832], "dtype": "float32"}, {"name": "conv5/block11/0/bn/moving_variance", "shape": [832], "dtype": "float32"}, {"name": "conv5/block11/1/conv/kernel", "shape": [1, 1, 832, 128], "dtype": "float32"}, {"name": "conv5/block11/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv5/block11/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv5/block11/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv5/block11/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv5/block11/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv5/block12/0/bn/gamma", "shape": [864], "dtype": "float32"}, {"name": "conv5/block12/0/bn/beta", "shape": [864], "dtype": "float32"}, {"name": "conv5/block12/0/bn/moving_mean", "shape": [864], "dtype": "float32"}, {"name": "conv5/block12/0/bn/moving_variance", "shape": [864], "dtype": "float32"}, {"name": "conv5/block12/1/conv/kernel", "shape": [1, 1, 864, 128], "dtype": "float32"}, {"name": "conv5/block12/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv5/block12/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv5/block12/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv5/block12/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv5/block12/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv5/block13/0/bn/gamma", "shape": [896], "dtype": "float32"}, {"name": "conv5/block13/0/bn/beta", "shape": [896], "dtype": "float32"}, {"name": "conv5/block13/0/bn/moving_mean", "shape": [896], "dtype": "float32"}, {"name": "conv5/block13/0/bn/moving_variance", "shape": [896], "dtype": "float32"}, {"name": "conv5/block13/1/conv/kernel", "shape": [1, 1, 896, 128], "dtype": "float32"}, {"name": "conv5/block13/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv5/block13/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv5/block13/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv5/block13/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv5/block13/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv5/block14/0/bn/gamma", "shape": [928], "dtype": "float32"}, {"name": "conv5/block14/0/bn/beta", "shape": [928], "dtype": "float32"}, {"name": "conv5/block14/0/bn/moving_mean", "shape": [928], "dtype": "float32"}, {"name": "conv5/block14/0/bn/moving_variance", "shape": [928], "dtype": "float32"}, {"name": "conv5/block14/1/conv/kernel", "shape": [1, 1, 928, 128], "dtype": "float32"}, {"name": "conv5/block14/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv5/block14/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv5/block14/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv5/block14/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv5/block14/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv5/block15/0/bn/gamma", "shape": [960], "dtype": "float32"}, {"name": "conv5/block15/0/bn/beta", "shape": [960], "dtype": "float32"}, {"name": "conv5/block15/0/bn/moving_mean", "shape": [960], "dtype": "float32"}, {"name": "conv5/block15/0/bn/moving_variance", "shape": [960], "dtype": "float32"}, {"name": "conv5/block15/1/conv/kernel", "shape": [1, 1, 960, 128], "dtype": "float32"}, {"name": "conv5/block15/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv5/block15/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv5/block15/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv5/block15/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv5/block15/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv5/block16/0/bn/gamma", "shape": [992], "dtype": "float32"}, {"name": "conv5/block16/0/bn/beta", "shape": [992], "dtype": "float32"}, {"name": "conv5/block16/0/bn/moving_mean", "shape": [992], "dtype": "float32"}, {"name": "conv5/block16/0/bn/moving_variance", "shape": [992], "dtype": "float32"}, {"name": "conv5/block16/1/conv/kernel", "shape": [1, 1, 992, 128], "dtype": "float32"}, {"name": "conv5/block16/1/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv5/block16/1/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv5/block16/1/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv5/block16/1/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv5/block16/2/conv/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "fc1000/kernel", "shape": [1024, 1000], "dtype": "float32"}, {"name": "fc1000/bias", "shape": [1000], "dtype": "float32"}]}]}